### 1. 启动建议右键管理员运行，并且锁定为永久配置性文件，动态的可能会产生各种各样的问题。

### 2. Ghub是个非常不稳定的软件，莫名其妙的bug很多。出现bug做好退出全部后台的准备：包括Ghub、logiAgent、logiUpdater等。

### 3. 穿越火线是99%枪械都是随机正反7字形弹道（有固定弹道的反例可以评论），所以基于鼠标位移的简单鼠标宏无法解决横向后坐力的问题。
所以我试验几次之后最终只考虑垂直方向的后座力控制，水平方向如果添加到鼠标宏可能适得其反；比如按照正7写的宏文件，碰到反7弹道时，水平后座会大的离谱。

### 4. 完整武器版本的基础设置是：鼠标800DPI，回报率1000hz，游戏内鼠标速度3，压枪量是基于这个设置进行调整的；如果个人设置不同，根据相应状况酌情调整即可。

### 5. 关于两个脚本问题：
第一个脚本完整版本可以比较好地控制开关，但鼠标宏不稳定，经常出现的bug就是按住鼠标只有第一下压枪，此后便不再移动；
第二个脚本（无法停止版本）因为逻辑循环问题，一旦开启就无法关闭，但异常稳定；我也曾借住deepseek、gpt优化过几次，但最后试验要么根本无法开启，要么还是这个bug，所以直接放弃了。
如果第一个完整版本可以稳定运行，那就最好了；如果无法运行，可以把压枪量和时间拷贝到稳定运行版本；使用完毕关闭后台重启Ghub皆可恢复正常。

### 6. 关于实战效果
实测压枪效果最好的是白虎，无鼠标宏白虎大概可以稳定连发3发，5发就很勉强了，宏版本可以7发以上，见人无脑按住就可以。
QBZ的弹道飘忽不定，不适合这种简单的鼠标宏压枪。
M4：众所周知M4扫起来非常飘，实际上M4主要的后座就是在于水平后座，无法解决的问题，使用体验不算太好。实测下来定位准的话，无论有没有宏都可以三连发带走，一旦扫起来有宏也很难控制。所以不是特别推荐。但体验也好于QBZ。
AK47：个人觉得体验还不错，可以把AK当QBZ打。实测下来见人就一组扫射就可以。另外消音AK在鼠标宏的加持下手感异常好，可以当白虎打。还有一把神器就是AK103，虽然弹道与AK47基本一致，但鼠标宏加持下，200ms的准心回复使得AK103的连发效果比AK47要好不少。
EVO：没有特别单独测试，跟白虎差不多。

### 7. 关于安全性
建议时间间隔不要调太低（跟炼狱宏和USP一个道理），只是压一下垂直后座，没有任何封禁风险。

